tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

cask_args appdir: "~/Applications"

brew "trash"

cask "alfred"
cask "apparency"
cask "appcleaner"
cask "betterzip"
cask "brooklyn"
cask "calibre"
cask "carbon-copy-cloner"
cask "daisydisk"
cask "discord"
cask "docker"
cask "dteoh-devdocs"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-input"
cask "font-jetbrains-mono"
cask "irccloud"
cask "itsycal"
cask "keepingyouawake"
cask "kitty"
cask "omnioutliner"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "rectangle"
cask "soulver2"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "syncthing"
cask "the-unarchiver"
cask "transmission-remote-gui"
cask "visual-studio-code"
cask "vivaldi"
cask "vlc"
cask "webpquicklook"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "Bear", id: 1091189122
mas "CleanMyDrive 2", id: 523620159
mas "com.bandan.Declutter", id: 1574021257
mas "Deliveries", id: 290986013
mas "GoodLinks", id: 1474335294
mas "Hidden Bar", id: 1452453066
mas "Hush", id: 1544743900
mas "LilyView", id: 529490330
mas "MusicHarbor", id: 1440405750
mas "PiPer", id: 1421915518
mas "PopClip", id: 445189367
mas "Privacy Redirect", id: 1578144015
mas "Reeder", id: 1529448980
mas "Refined GitHub", id: 1519867270
mas "Save to Matter", id: 1548677272
mas "SessionRestore", id: 1463334954
mas "Shut Up", id: 1015043880
mas "Social Fixer for Facebook", id: 1562017526
mas "Spark", id: 1176895641
mas "StopTheMadness", id: 1376402589
mas "Tampermonkey", id: 1482490089
mas "Toolkit for YNAB", id: 1592912837
mas "uBlacklist for Safari", id: 1547912640
mas "UnPlugged", id: 423123087
mas "Userscripts", id: 1463298887
mas "Vinegar", id: 1591303229
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054
