cask_args appdir: "~/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

brew "mas"
brew "trash"

cask "alfred"
cask "apparency"
cask "appcleaner"
cask "bbedit"
cask "betterzip"
cask "brooklyn"
cask "carbon-copy-cloner@6"
cask "daisydisk"
cask "discord"
cask "dteoh-devdocs"
cask "jordanbaird-ice"
cask "keepingyouawake"
cask "keka"
cask "kitty"
cask "omnioutliner"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "reader"
cask "rectangle"
cask "shifty"
cask "soulver2"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "syncthing"
cask "the-unarchiver"
cask "transmission-remote-gui"
cask "visual-studio-code"
cask "vivaldi"
cask "webpquicklook"
cask "zed"

mas "1Password for Safari", id: 1569813296
mas "AdGuard for Safari", id: 1440147259
mas "CleanMyDrive 2", id: 523620159
mas "Declutter", id: 1574021257
mas "Deliveries", id: 290986013
mas "FakespotSafari", id: 1592541616
mas "Hush", id: 1544743900
mas "Kagi for Safari", id: 1622835804
mas "LilyView", id: 529490330
mas "MusicHarbor", id: 1440405750
mas "PiPer", id: 1421915518
mas "Play", id: 1596506190
mas "PopClip", id: 445189367
mas "Privacy Redirect", id: 1578144015
mas "Refined GitHub", id: 1519867270
mas "Save to Reader", id: 1640236961
mas "SessionRestore", id: 1463334954
mas "Shut Up", id: 1015043880
mas "Social Fixer for Facebook", id: 1562017526
mas "StopTheMadness Pro", id: 6471380298
mas "Tampermonkey Classic", id: 1482490089
mas "Toolkit for YNAB", id: 1592912837
mas "uBlock Origin Lite", id: 6745342698
mas "UnPlugged", id: 423123087
mas "Userscripts-Mac-App", id: 1463298887
mas "Vinegar", id: 1591303229
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054

{{ if .ebook_library -}}
cask "calibre"
{{- end }}
{{ if and .gaming (not .work) -}}
cask "steam"
mas "Steam Link", id: 1246969117
{{- end }}
{{ if .video -}}
cask "vlc"
{{- end }}
