cask_args appdir: "~/Applications"

tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"

# cli tools
brew "mas"
brew "trash"

# apps
cask "apparency"
cask "appcleaner"
cask "betterzip"
cask "brooklyn"
cask "carbon-copy-cloner@6"
cask "claude-code"
cask "daisydisk"
cask "discord"
cask "keepingyouawake"
cask "keka"
cask "kitty"
cask "maccy"
cask "obsidian"
cask "omnioutliner"
cask "popclip"
cask "raycast"
cask "reader"
cask "rectangle"
cask "shifty"
cask "soulver2"
cask "suspicious-package"
cask "swiftdefaultappsprefpane"
cask "syncthing-app"
cask "vivaldi"
cask "visual-studio-code"
cask "zed"

{{ if not .work -}}
cask "jordanbaird-ice"

mas "Declutter", id: 1574021257
mas "Deliveries", id: 290986013
mas "LilyView", id: 529490330
mas "UnPlugged", id: 423123087
mas "WiFi Explorer", id: 494803304
mas "WiFi Signal", id: 525912054
{{- end }}

# safari extensions
{{ if not .work -}}
mas "1Password for Safari", id: 1569813296
mas "Hush", id: 1544743900
mas "Kagi for Safari", id: 1622835804
mas "Privacy Redirect", id: 1578144015
mas "Save to Reader", id: 1640236961
mas "SessionRestore", id: 1463334954
mas "StopTheMadness Pro", id: 6471380298
mas "Tampermonkey Classic", id: 1482490089
mas "uBlock Origin Lite", id: 6745342698
mas "Vinegar", id: 1591303229
{{- end }}

# coding
{{ if .coding -}}
cask "dteoh-devdocs"
{{- end }}

# containers
{{ if .containers -}}
cask "swiftbar"
{{- end }}

# ebook_library
{{ if .ebook_library -}}
cask "calibre"
{{- end }}

# ephemeral
{{ if .ephemeral -}}
# add ephemeral-specific items here
{{- end }}

# gaming
{{ if and .gaming (not .work) -}}
cask "steam"
mas "Steam Link", id: 1246969117
{{- end }}

# music
{{ if and .music (not .work) -}}
mas "MusicHarbor", id: 1440405750
{{- end }}

# music_library
{{ if .music_library -}}
# add music library apps here
{{- end }}

# personal
{{ if .personal -}}
cask "transmission-remote-gui"
{{- end }}

# video
{{ if and .video (not .work) -}}
cask "vlc"
mas "Play", id: 1596506190
{{- end }}

# work
{{ if .work -}}
cask "slack"
cask "zoom"
{{- end }}
