{
	"$schema" : "https://aka.ms/winget-packages.schema.2.0.json",
	"CreationDate" : "2023-12-13T08:27:34.134-00:00",
	"Sources" : 
	[
		{
			"Packages" : 
			[
				{ "PackageIdentifier" : "7zip.7zip" },
				{ "PackageIdentifier" : "AgileBits.1Password" },
				{ "PackageIdentifier" : "Discord.Discord" },
				{ "PackageIdentifier" : "Ditto.Ditto" },
				{ "PackageIdentifier" : "GnuPG.Gpg4win" },
				{ "PackageIdentifier" : "HexChat.HexChat" },
				{ "PackageIdentifier" : "IRCCloud.IRCCloud" },
				{ "PackageIdentifier" : "AutoHotkey.AutoHotkey" },
				{ "PackageIdentifier" : "Microsoft.PowerShell" },
				{ "PackageIdentifier" : "Microsoft.PowerToys" },
				{ "PackageIdentifier" : "Microsoft.Teams" },
				{ "PackageIdentifier" : "Microsoft.VisualStudio.2022.BuildTools"},
				{ "PackageIdentifier" : "Microsoft.VisualStudioCode" },
				{ "PackageIdentifier" : "Microsoft.WindowsTerminal" },
				{ "PackageIdentifier" : "Notepad++.Notepad++" },
				{ "PackageIdentifier" : "PuTTY.PuTTY" },
				{ "PackageIdentifier" : "QL-Win.QuickLook" },
				{ "PackageIdentifier" : "Rufus.Rufus" },
				{ "PackageIdentifier" : "SyncTrayzor.SyncTrayzor" },
				{ "PackageIdentifier" : "VivaldiTechnologies.Vivaldi" }
			],
			"SourceDetails" : 
			{
				"Argument" : "https://cdn.winget.microsoft.com/cache",
				"Identifier" : "Microsoft.Winget.Source_8wekyb3d8bbwe",
				"Name" : "winget",
				"Type" : "Microsoft.PreIndexed.Package"
			}
		},
		{
			"Packages" :
			[
					{ "PackageIdentifier" : "9NPZ2TVKJVT7" } // SnipDo
			],
			"SourceDetails" :
			{
					"Argument" : "https://storeedgefd.dsx.mp.microsoft.com/v9.0",
					"Identifier" : "StoreEdgeFD",
					"Name" : "msstore",
					"Type" : "Microsoft.Rest"
			}
		}
	],
	"WinGetVersion" : "1.6.3421"
}
